1c_um/src/DataProcessors/ум_ИзменениеПакетовДанных/ум_ИзменениеПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ум_ИзменениеПакетовДанных</name>
</mdclass:DataProcessor>

1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/DataProcessors/ум_ИзменениеПакетовДанных/Forms/Форма/Module.bsl
// ТУДУ сделать контроль заполения отмеченных реквизитов, сделать управление видимостью. делать одниакогов с формаой ручного изм. пакетов
// ТУДУ привести список выбранных для измененияпакетов в норм вид. Запретить редактирование, 
// добавит команды обработки вручную, отркытия данных пакета. расположить колонки и настроиить их аналогично списку пакетов данных

// ТУДУ - нужен новый предопределнный способ обработки "Многопоточное изменение пакетов данных" Данные - Стркутура ОписаниеДействия + Массив идентификаторов.
// ТУДУ полный рефакторинг кода формы. Визуал я сделал.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособОбработкиИзмененияПакетов = Справочники.ум_СпособыОбработкиПакетов.МногопоточноеИзменениеПакетовДанных;
	
	// создадим отборы по умолчанию на странице обработки пакетов
	Элемент = СписокИзменяемыхПакетов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Использование = Ложь;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючАналитикиПакетаДанных.СостояниеПакетаДанных");
	
	Элемент = СписокИзменяемыхПакетов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Использование = Ложь;
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючАналитикиПакетаДанных.СпособОбработкиПакетов");
	
	РазмерСоздаваемогоПакета = 100;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ум_ОбновитьФормуСпискаПакетов" Тогда
		
		Элементы.СписокИзменяемыхПакетов.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаИзменитьПакетыОффлайн(Команда)
	
	Если Не УдалитьПакеты И Не ИзменитьСостояние И Не ИзменитьСпособОбработки И Не ИзменитьПакетПрипаркован И
		Не ИзменитьКоличествоПопытокОбработки И Не ИзменитьДатуСледующейОбработки Тогда
		ПоказатьПредупреждение(, "Не выбрано действие с пакетами!", , "Не выбрано действие");
		Возврат;
	КонецЕсли;
	
	Если НЕ УдалитьПакеты И ИзменитьСостояние и Не ЗначениеЗаполнено(Состояние) Тогда
		ПоказатьПредупреждение(, "Не заполнено новое состояние пакетов данных!", , "Не заполнены реквизиты");
		Возврат;
	КонецЕсли;
	
	Если НЕ УдалитьПакеты И ИзменитьСпособОбработки и Не ЗначениеЗаполнено(СпособОбработки) Тогда
		ПоказатьПредупреждение(, "Не заполнен новый способ оюбработки пакетов!", , "Не заполнены реквизиты");
		Возврат;
	КонецЕсли;
	
	ДействияВыбраны = Ложь; 
	ТестДиалогаПодтверждения = "Выполнить действия:";
	Если УдалитьПакеты Тогда
		ДействияВыбраны = Истина;
		ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Удалить пакеты " + """";
	Иначе
		Если ИзменитьСостояние Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить состояние - """ + Состояние + """";
		КонецЕсли;
		Если ИзменитьСпособОбработки Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить способ обработки - """ + СпособОбработки + """";
		КонецЕсли;
		Если ИзменитьКоличествоПопытокОбработки Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить Количество попыток обработки - " + КоличествоПопытокОбработки;
		КонецЕсли;
		Если ИзменитьДатуСледующейобработки Тогда
			//ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить дату следующей обработки - " + ДатаСледующейОбработки;
		КонецЕсли;
		Если ИзменитьПакетПрипаркован Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить пакет припаркован - """ + ПакетПрипаркован + """";
		КонецЕсли;
	КонецЕсли;
	
	МассивИдентификаторов = ПолучитьСписокПакетовДляИзменения();
	Если НЕ МассивИдентификаторов.Количество() Тогда
		Сообщить("Нет элементов для обработки!");
		Возврат;
	КонецЕсли;
	
	ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + "?" + Символы.ПС + "Количество пакетов: " + МассивИдентификаторов.Количество();
	
	ДополнительныеПараметры = Новый Структура("МассивИдентификаторов", МассивИдентификаторов);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаИзменитьПакетыОффлайн", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТестДиалогаПодтверждения, РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Отмена, "Изменение пакетов?");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбработатьПакеты(Команда)
	
	МассивДанныхПакетов = ПолучитьДанныеВыделенныхСтрокПакетов();
	
	Если Не ЗначениеЗаполнено(МассивДанныхПакетов) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Обработать " + Строка(МассивДанныхПакетов.Количество()) + " пакета(-ов)?";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивДанныхПакетов", МассивДанныхПакетов);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьПакетыКоманда_Продолжение",  ЭтаФорма, ДополнительныеПараметры);	 	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена, "Пакеты обработки");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьДанныеПакета(Команда)
	
	ТекущиеДанные = Элементы.СписокИзменяемыхПакетов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилищаДанных = ПолучитьДанныеПакетаВХранилище(ТекущиеДанные.ИдентификаторПакета);
	ПараметрыФормы = Новый Структура("АдресХранилищаДанных", АдресХранилищаДанных);
	ТекстЗаголовка = СтрШаблон("Данные пакета: %1", Строка(ТекущиеДанные.ИдентификаторПакета));
	ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПросмотраДанных",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 ,
				 РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать
	);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	ДополнительныеПараметры = Новый Структура("ДиалогОткрытия", ДиалогОткрытия);
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогОткрытия.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытия = ДополнительныеПараметры.ДиалогОткрытия;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		КаталогВыгрузки = ДиалогОткрытия.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособОбработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСледующейОбработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоПопытокОбработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПакетПрипаркованПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПакетыПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

#Область Обработка_Пакетов_Оффлайн

&НаСервере
Функция ПолучитьСписокПакетовДляИзменения()
	
	Схема		 = Элементы.СписокИзменяемыхПакетов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки	 = Элементы.СписокИзменяемыхПакетов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки	= новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода		= новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ВсегоСтрок = Результат.Количество();
	Для Итер = 1 по ВсегоСтрок Цикл
		ТекСтрока = Результат[ВсегоСтрок - Итер];
		Если ТекСтрока.ИдентификаторПакета = "" ИЛИ ТекСтрока.ИдентификаторПакета = Неопределено Тогда
			Результат.Удалить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат.ВыгрузитьКолонку("ИдентификаторПакета");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаИзменитьПакетыОффлайн(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РазмерПакета = РазмерСоздаваемогоПакета;
	ТекстОписания = "Действия: ";
	Разделитель = "";
	
	ОписаниеДействий = Новый Структура();
	
	Если УдалитьПакеты Тогда
		
		ОписаниеДействий.Вставить("УдалитьПакеты", УдалитьПакеты);
		
	Иначе
		
		ОписаниеДействий.Вставить("ИзменитьСостояние"	, ИзменитьСостояние);
		ОписаниеДействий.Вставить("Состояние"			, Состояние);
		
		ОписаниеДействий.Вставить("ИзменитьСпособОбработки"	, ИзменитьСпособОбработки);
		ОписаниеДействий.Вставить("СпособОбработки"			, СпособОбработки);
		
		ОписаниеДействий.Вставить("ИзменитьКоличествоПопытокОбработки"	, ИзменитьКоличествоПопытокОбработки);
		ОписаниеДействий.Вставить("КоличествоПопытокОбработки"			, КоличествоПопытокОбработки);
		
		ОписаниеДействий.Вставить("ИзменитьДатуСледующейобработки"	, ИзменитьДатуСледующейОбработки);
		ОписаниеДействий.Вставить("ДатаСледующейОбработки"			, ДатаСледующейОбработки);
		
		ОписаниеДействий.Вставить("ИзменитьПакетПрипаркован"	, ИзменитьПакетПрипаркован);
		ОписаниеДействий.Вставить("ПакетПрипаркован"			, ПакетПрипаркован);
		
	КонецЕсли;
	
	Если ОписаниеДействий.Количество() = 0 Тогда
		Сообщить("Не указаны действия с пакетом!");
		Возврат;
	КонецЕсли;
	
	ТекстОписания = СформироватьТекстОписания();
	
	ИдентификаторЗадания = СформироватьФоновоеЗаданиеНаФормированиеПакетов(	ДополнительныеПараметры.МассивИдентификаторов,
																			ОписаниеДействий,
																			ТекстОписания,
																			РазмерПакета
	);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
	ПараметрыФормы.Вставить("АвтоЗакрытие", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСозданияПакетовДанных", ЭтотОбъект, Неопределено);
	
	ОткрытьФорму("ОбщаяФорма.ум_ФормаПрогрессБар",
				 ПараметрыФормы,
				 ЭтаФорма,
				 УникальныйИдентификатор,
				 ,
				 ,
				 Оповещение,
				 РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца
	);
	
КонецПроцедуры

&НаСервере
Функция СформироватьФоновоеЗаданиеНаФормированиеПакетов(МассивИдентификаторов, ОписаниеДействий, ТекстОписания, РазмерПакета)
	Перем ДанныеРасшифровки;
	
	ИмяПроцедуры = "ум_ИзменениеПакетовДанных.СоздатьПакетыМногопоточноеИзменениеПакетовДанных";
	ПараметрыПроцедуры = Новый Массив;
	ПараметрыПроцедуры.Добавить(МассивИдентификаторов);
	ПараметрыПроцедуры.Добавить(ОписаниеДействий);
	ПараметрыПроцедуры.Добавить(ТекстОписания);
	ПараметрыПроцедуры.Добавить(РазмерПакета);
	
	Задание = ФоновыеЗадания.Выполнить(ИмяПроцедуры, ПараметрыПроцедуры, , "ум_ИзменениеПакетовДанных");
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Возврат ИдентификаторЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьРеквизитов()
	
	Элементы.ИзменитьСостояние.Доступность					= НЕ УдалитьПакеты;
	Элементы.ИзменитьСпособОбработки.Доступность 			= НЕ УдалитьПакеты;
	Элементы.ИзменитьДатуСледующейОбработки.Доступность 	= НЕ УдалитьПакеты;
	Элементы.ИзменитьКоличествоПопытокОбработки.Доступность	= НЕ УдалитьПакеты;
	Элементы.ИзменитьПакетПрипаркован.Доступность 			= НЕ УдалитьПакеты;
	
	Элементы.Состояние.Доступность			 		= ИзменитьСостояние и НЕ УдалитьПакеты;
	Элементы.СпособОбработки.Доступность 			= ИзменитьСпособОбработки и НЕ УдалитьПакеты;
	Элементы.ДатаСледующейОбработки.Доступность 	= ИзменитьДатуСледующейОбработки и НЕ УдалитьПакеты;
	Элементы.КоличествоПопытокОбработки.Доступность = ИзменитьКоличествоПопытокОбработки и НЕ УдалитьПакеты;
	Элементы.ПакетПрипаркован.Доступность 			= ИзменитьПакетПрипаркован и НЕ УдалитьПакеты;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСозданияПакетовДанных(Результат, ДопПараметры) Экспорт
	
	Оповестить("ум_ОбновитьФормуСпискаПакетов");
	
КонецПроцедуры

#КонецОбласти // Обработка_Пакетов_Оффлайн

#Область Обработка_Пакетов_Онлайн

&НаКлиенте
Функция ОбработатьПакеты(Параметры)
	
	МассивДанныхПакетов = Параметры.МассивДанныхПакетов;
	
	КоличествоСтрок = МассивДанныхПакетов.Количество();
	
	Для А = 0  По КоличествоСтрок - 1 Цикл
		Состояние("Обработка пакетов...", Окр(100 * А / КоличествоСтрок)); 
		
		ДанныеПакета = МассивДанныхПакетов[А];
		
		Если НЕ ЗначениеЗаполнено(ДанныеПакета.СпособОбработки) Тогда
			Сообщить("Невозможно обработать пакет с идентификатором """+ДанныеПакета.ИдентификаторПакета+""", т.к. в нем не выбран способ обработки пакета!");
			Продолжить;
		КонецЕсли;
		
		ОбработатьПакетНаСервере(ДанныеПакета.ИдентификаторПакета, ДанныеПакета.СпособОбработки);
		
	КонецЦикла;
	
	Состояние("Обработка пакетов...", 100);
	
КонецФункции

&НаСервере
Процедура ОбработатьПакетНаСервере(ИдентификаторПакета, СпособОбработки)
	ПараметрыСпособаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПолучитьПараметрыСпособаОбработки(СпособОбработки);
	ПараметрыСпособаОбработки.Вставить("ОбработкаПакетаВСеансеКлиента", Истина);
		
	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить(ИдентификаторПакета);
	ум_ПакетыДанныхОбработка.ОбработчикРабочегоФЗ(МассивИдентификаторов, ПараметрыСпособаОбработки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПакетыКоманда_Продолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьПакеты(ДопПараметры);
	Оповестить("ум_ОбновитьФормуСпискаПакетов");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтруктурПоТаблице(ТаблицаЗначений)
	
	МассивСтруктур = Новый Массив;
	Для каждого СтрТаблицы из ТаблицаЗначений Цикл 
		
		СтруктураСтроки = Новый Структура;
		Для каждого КолонкаТаблицы из ТаблицаЗначений.Колонки Цикл
			СтруктураСтроки.Вставить(КолонкаТаблицы.Имя, СтрТаблицы[КолонкаТаблицы.Имя]);
		КонецЦикла;
		
		МассивСтруктур.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Возврат МассивСтруктур;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеВыделенныхСтрокПакетов()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ум_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.0") > 0 Тогда
		МассивВыделенныхСтрок = Элементы.СписокИзменяемыхПакетов.ПолучитьСтрокиДляОбработки();
	Иначе
		МассивВыделенныхСтрок = Элементы.СписокИзменяемыхПакетов.ВыделенныеСтроки;
	КонецЕсли;
	
	МассивИдентификаторовПакетов = Новый Массив;
	Для каждого КлючСтроки Из МассивВыделенныхСтрок Цикл
		МассивИдентификаторовПакетов.Добавить(КлючСтроки.ИдентификаторПакета);
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета,
	|	ум_ПакетыДанных.КлючАналитикиПакетаДанных.СпособОбработкиПакетов КАК СпособОбработки,
	|	ум_ПакетыДанных.ДатаСозданияПакета КАК ДатаСозданияПакета
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.ИдентификаторПакета В(&МассивИдентификаторов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ум_ПакетыДанных.ДатаСозданияПакета";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивИдентификаторов",  МассивИдентификаторовПакетов);
	
	ТаблицаПакетов = Запрос.Выполнить().Выгрузить();
	
	МассивДанныхПакетов = ПолучитьМассивСтруктурПоТаблице(ТаблицаПакетов);
	
	Возврат МассивДанныхПакетов;
	
КонецФункции

#КонецОбласти // Обработка_Пакетов_Онлайн

&НаСервереБезКонтекста
Функция ПолучитьДанныеПакетаВХранилище(ИдентификаторПакета, ИдентификаторФормы = Неопределено) Экспорт
	Данные = ум_ПакетыДанныхОбщегоНазначения.ПолучитьДанныеПакета(ИдентификаторПакета);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, ИдентификаторФормы);
	Возврат АдресХранилища;
КонецФункции

&НаСервере
Функция СоздатьПакетДанных(Данные, СпособОбработки, ДатаСледующейОбработкиПакета, ДополнительнаяИнформация = "", Комментарий = "") Экспорт
		Результат = ум_ПакетыДанных.СоздатьПакетДанных(	Данные,
														СпособОбработки,
														ДатаСледующейОбработкиПакета,
														ДополнительнаяИнформация,
														Комментарий
		);
		Возврат Результат;
КонецФункции

&НаКлиенте
Функция СформироватьТекстОписания()
	
	ТекстОписания = "";
	
	Если УдалитьПакеты Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + " удаление пакетов";
		Возврат ТекстОписания;
	КонецЕсли;
	
	Если ИзменитьДатуСледующейОбработки Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + "дата сл. обр. = " + ДатаСледующейОбработки;
	КонецЕсли;
	Если ИзменитьКоличествоПопытокОбработки Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + "кол. попыток = " + КоличествоПопытокОбработки;
	КонецЕсли;
	Если ИзменитьПакетПрипаркован Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + "припаркован = " + ПакетПрипаркован;
	КонецЕсли;
	Если ИзменитьСостояние Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + "состояние = " + Состояние;
	КонецЕсли;
	Если ИзменитьСпособОбработки Тогда
		ТекстОписания = ТекстОписания + ?(ЗначениеЗаполнено(ТекстОписания), " / ", "") + "способ обработки = " + СпособОбработки;
	КонецЕсли;
		
	Возврат ТекстОписания;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
